# Assessing Users Data in Python

In [2]:
# import packages
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

In [4]:
# read the ecommerce file into a dataframe
df_users = pd.read_csv('ecommerce_users.csv')

## Functions to assess dataframes(tables) in pandas
### Looking at what the dataframe contains
1. head function
2. tail function
3. sample function

In [5]:
# the head function
df_users.head() # by default, it shows the first five rows

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,21304,Heidi,Hall,NaN,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC
1,5012,Billy,Guerrero,1.800341e+09,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC
2,27817,Antonio,Williams,NaN,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC
3,14079,Ryan,Brown,NaN,ryanbrown@example.com,68.0,M,Bahia,277 Walker Mountains,45920-000,Nova Viçosa,Brasil,-17.900464,-39.716076,Search,2019-01-02 00:43:00 UTC
4,93946,Sabrina,Rodriguez,1.800594e+09,sabrinarodriguez@example.net,39.0,F,Florida,06720 Smith Summit Suite 860,34711,Clermont,United States,28.525665,-81.756419,Search,2019-01-02 01:14:00 UTC

In [9]:
# to see other than five rows, you put the number in the bracket
df_users.head(3)

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,21304,Heidi,Hall,NaN,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC
1,5012,Billy,Guerrero,1.800341e+09,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC
2,27817,Antonio,Williams,NaN,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC

In [11]:
# the tail function
df_users.tail(6)

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
99994,79066,Travis,Allen,1.800556e+09,travisallen@example.org,17.0,M,California,665 Richard Inlet,91767,Pomona,United States,34.081517,-117.738461,Search,2023-04-26 19:23:03.636324 UTC
99995,98969,Linda,Mcgrath,1.800139e+09,lindamcgrath@example.org,54.0,F,Florida,2787 Barrett Valleys Apt. 986,33312,Fort Lauderdale,United States,26.088242,-80.181492,Display,2023-04-26 19:25:09.399335 UTC
99996,56920,Jasmine,Valdez,NaN,jasminevaldez@example.net,68.0,F,Île-de-France,4700 Mccann Green,75016,Paris,France,48.857391,2.256367,Search,2023-04-26 19:29:08.280281 UTC
99997,77719,Haley,Campbell,NaN,haleycampbell@example.com,50.0,F,Bourgogne-Franche-Comté,855 Suarez Walks,21000,Dijon,France,47.322872,5.037560,Search,2023-04-26 19:29:23.730034 UTC
99998,70163,Brianna,Dalton,1.800954e+09,briannadalton@example.com,28.0,F,Texas,015 Mcgee Fords Apt. 880,78589,San Juan,United States,26.186049,-98.151782,Search,2023-04-26 19:33:36.935949 UTC
99999,95519,Darin,Ortiz,NaN,darinortiz@example.com,66.0,M,Rio de Janeiro,430 Megan Mission,22750-008,Rio de Janeiro,Brasil,-22.937678,-43.336215,Search,2023-04-26 19:35:28.485865 UTC

In [17]:
# sample function
df_users.sample(5)

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
9721,65413,Rebecca,Lopez,NaN,rebeccalopez@example.com,25.0,F,Goiás,3122 Annette Radial Suite 779,75370-000,NaN,Brasil,-16.496023,-49.431975,Search,2019-06-08 14:16:00 UTC
91865,39801,Todd,White,NaN,toddwhite@example.org,68.0,M,Fujian,638 Jennifer Well,361110,Zhengzhou,China,24.702806,118.128648,Search,2023-01-26 13:53:00 UTC
73450,83435,Amy,Jones,1.800202e+09,amyjones@example.com,60.0,F,District of Columbia,70820 Evans Inlet,20003,Washington,United States,38.881006,-76.990183,Search,2022-04-05 13:37:00 UTC
33708,16611,Kristy,Phillips,1.800681e+09,kristyphillips@example.com,19.0,F,Florida,569 Aaron Radial,33021,Hollywood,United States,26.022942,-80.187137,Search,2020-06-28 12:38:00 UTC
32375,10428,Daniel,Rodriguez,NaN,danielrodriguez@example.com,50.0,M,Guizhou,032 Smith Ridge,550004,Wenzhou,China,26.614484,106.755908,Facebook,2020-06-07 02:15:00 UTC

### Describing the data
1. info
2. describe

`dataframe.info()` summarizes:
* The number of rows and columns present
* It counts not null values present
* Datatypes that are present

In [18]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              100000 non-null  int64
 1   first_name      100000 non-null  object
 2   last_name       100000 non-null  object
 3   phone_number    22669 non-null   float64
 4   email           99999 non-null   object
 5   age             99998 non-null   float64
 6   gender          100000 non-null  object
 7   state           100000 non-null  object
 8   street_address  100000 non-null  object
 9   postal_code     100000 non-null  object
 10  city            99007 non-null   object
 11  country         100000 non-null  object
 12  latitude        99998 non-null   float64
 13  longitude       99998 non-null   float64
 14  traffic_source  100000 non-null  object
 15  created_at      100000 non-null  object
dtypes: float64(4), int64(1), object(11)
memory usage: 12.2+ MB

#### Issue log
1. Null values in phone number, email, age, city, longitude and latitude fields
2. Id, phone number, age, latitude and longitude have inaccurate data types

In [19]:
df_users.describe()

                  id  phone_number           age      latitude     longitude
count  100000.000000  2.266900e+04  99998.000000  99998.000000  99998.000000
mean    50000.500000  1.800250e+09     41.006170     28.305884     24.344178
std     28867.657797  2.262793e+07     17.033479     22.052213     89.964565
min         1.000000  1.800387e+07     12.000000    -43.160756   -158.164931
25%     25000.750000  1.800324e+09     26.000000     26.110473    -51.049500
50%     50000.500000  1.800550e+09     41.000000     35.247482      4.411841
75%     75000.250000  1.800773e+09     56.000000     40.725404    116.345098
max    100000.000000  1.801000e+09     70.000000     64.865194    153.560238

#### Number of rows and columns present: df.shape

In [20]:
df_users.shape

(100000, 16)

In [23]:
# separate rows
df_users.shape[0]

100000

In [25]:
len(df_users)

100000

In [24]:
# separate columns
df_users.shape[1]

16

#### Count not null values: df.notna().sum()

In [28]:
# count not null values
df_users.notnull().sum()

id                100000
first_name        100000
last_name         100000
phone_number       22669
email              99999
age                99998
gender            100000
state             100000
street_address    100000
postal_code       100000
city               99007
country           100000
latitude           99998
longitude          99998
traffic_source    100000
created_at        100000
dtype: int64

In [29]:
# count null values
df_users.isnull().sum()

id                    0
first_name            0
last_name             0
phone_number      77331
email                 1
age                   2
gender                0
state                 0
street_address        0
postal_code           0
city                993
country               0
latitude              2
longitude             2
traffic_source        0
created_at            0
dtype: int64

In [32]:
# not null for the city column
df_users['city'].notnull().sum()

99007

In [33]:
# not null for the city column
df_users.city.notnull().sum()

99007

#### Know datatypes: df.dtypes

In [30]:
df_users.dtypes

id                  int64
first_name         object
last_name          object
phone_number      float64
email              object
age               float64
gender             object
state              object
street_address     object
postal_code        object
city               object
country            object
latitude          float64
longitude         float64
traffic_source     object
created_at         object
dtype: object

In [34]:
df_users.city.dtypes

dtype('O')

In [35]:
df_users.age.dtypes

dtype('float64')

In [36]:
df_users.id.dtypes

dtype('int64')